---
type: FunctionId
namespace: Autodesk.Revit.Exceptions
version: 2024
members: 4
tags: [revit-api, class]
---

# FunctionId

`Autodesk.Revit.Exceptions.FunctionId` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetObjectData | — | `public virtual void GetObjectData ( SerializationInfo info , StreamingContext context )` |
| Property | File | — | `public string File { get ; }` |
| Property | Function | — | `public string Function { get ; }` |
| Property | Line | — | `public int Line { get ; }` |